2zzyyyq/3C/n32g033_std_periph_driver/src/n32g033_uart.c
    if ((UART_INT & UART_CTRL1_INTMASK) != 0x00U) /* The IT  is in CTRL1 register */
    {
        itmask &= UARTx->CTRL1;
    }
    else if ((UART_INT & UART_CTRL2_INTMASK) != 0x00U) /* The IT  is in CTRL2 register */
    {
        itmask &= UARTx->CTRL2;
    }
    else /* The IT  is in CTRL3 register */
    {
        itmask &= UARTx->CTRL3;
    }

    if (itmask != (uint32_t)RESET)
    {
        bitstatus = SET;
    }
    else
    {
        bitstatus = RESET;
    }

    return bitstatus;
}

/**
*\*\name    UART_PinSwapSet
*\*\fun     Swap TX/RX pins enable or disable.
*\*\param   UARTx (The input parameters must be the following values):
*\*\          - UART1
*\*\          - UART2
*\*\          - UART3
*\*\param  Cmd:(The input parameters must be the following values)
*\*\          - ENABLE
*\*\          - DISABLE 
*\*\return  none
**/
void UART_PinSwapSet(UART_Module* UARTx,FunctionalState Cmd)
{
    if(Cmd == ENABLE)
    {
        UARTx->CTRL1 |= CTRL1_SWAP_ENABLE;
    }
    else
    {
        UARTx->CTRL1 &= CTRL1_SWAP_DISABLE;
    }
}


/**
*\*\name    UART_CfgDriverAssertTime
*\*\fun     Set Driver Enable assertion time.
*\*\param   UARTx (The input parameters must be the following values):
*\*\          - UART1
*\*\          - UART2
*\*\          - UART3
*\*\param  Time:(The input parameters must be the following values)
*\*\          - 0x01 ~ 0x1F
*\*\return  none
**/
void UART_CfgDriverAssertTime(UART_Module* UARTx,uint32_t Time)
{
    UARTx->CTRL1 &= (~UART_CTRL1_DEAT_MASK);
    UARTx->CTRL1 |= (Time << 21U);
}


/**
*\*\name    UART_CfgDriverdeassertTime
*\*\fun     Set Driver Enable deassertion time.
*\*\param   UARTx (The input parameters must be the following values):
*\*\          - UART1
*\*\          - UART2
*\*\          - UART3
*\*\param  Time:(The input parameters must be the following values)
*\*\          - 0x01 ~ 0x1F
*\*\return  none
**/
void UART_CfgDriverdeassertTime(UART_Module* UARTx,uint32_t Time)
{
    UARTx->CTRL1 &= (~UART_CTRL1_DEDT_MASK);
    UARTx->CTRL1 |= (Time << 16U);
}


/**
*\*\name    UART_DriverPolaritySet
*\*\fun     Driver enable polarity selection.
*\*\param   UARTx (The input parameters must be the following values):
*\*\          - UART1
*\*\          - UART2
*\*\          - UART3
*\*\param  Cmd:(The input parameters must be the following values)
*\*\          - ENABLE
*\*\          - DISABLE 
*\*\return  none
**/
void UART_DriverPolaritySet(UART_Module* UARTx,FunctionalState Cmd)
{
    if(Cmd == ENABLE)
    {
        UARTx->CTRL1 |= CTRL1_DEP_ENABLE;
    }
    else
    {
        UARTx->CTRL1 &= CTRL1_DEP_DISABLE;
    }
}


/**
*\*\name    UART_DriverModeSet
*\*\fun     Driver enable mode selection.
*\*\param   UARTx (The input parameters must be the following values):
*\*\          - UART1
*\*\          - UART2
*\*\          - UART3
*\*\param  Cmd:(The input parameters must be the following values)
*\*\          - ENABLE
*\*\          - DISABLE 
*\*\return  none
**/
void UART_DriverModeSet(UART_Module* UARTx,FunctionalState Cmd)
{
    if(Cmd == ENABLE)
    {
        UARTx->CTRL1 |= CTRL1_DEM_ENABLE;
    }
    else
    {
        UARTx->CTRL1 &= CTRL1_DEM_DISABLE;
    }
}


/**
*\*\name    UART_RTOSet
*\*\fun     Receiver timeout enable or disable.
*\*\param   UARTx (The input parameters must be the following values):
*\*\          - UART1
*\*\          - UART2
*\*\          - UART3
*\*\param  Cmd:(The input parameters must be the following values)
*\*\          - ENABLE
*\*\          - DISABLE 
*\*\return  none
**/
void UART_RTOSet(UART_Module* UARTx,FunctionalState Cmd)
{
    if(Cmd == ENABLE)
    {
        UARTx->CTRL2 |= CTRL2_RTO_ENABLE;
    }
    else
    {
        UARTx->CTRL2 &= CTRL2_RTO_DISABLE;
    }
}


/**
*\*\name    UART_CfgRTOWidth
*\*\fun     configure receive timeout width.
*\*\param   UARTx (The input parameters must be the following values):
*\*\          - UART1
*\*\          - UART2
*\*\          - UART3
*\*\param  Width:(The input parameters must be the following values)
*\*\          - 0x00000000 ~ 0x0FFFFFFF
*\*\return  none
**/
void UART_CfgRTOWidth(UART_Module* UARTx,uint32_t Width)
{
    UARTx->RTO = Width;
}


/**
*\*\name    UART_CfgWakeupMode
*\*\fun     configure wakeup mode.
*\*\param   UARTx (The input parameters must be the following values):
*\*\          - UART3
*\*\param  WakeupEn:(The input parameters must be the following values)
*\*\          - UART_WAKEUP_DATACLR
*\*\          - UART_WAKEUP_DATANCLR
*\*\param  WakeupMode:(The input parameters must be the following values)
*\*\          - UART_WAKEUP_ENABLE
*\*\          - UART_WAKEUP_DISABLE
*\*\return  none
**/
void UART_CfgWakeupMode(UART_Module* UARTx,uint32_t WakeupEn,uint32_t WakeupMode)
{
    UARTx->WKUP = (WakeupEn | WakeupMode);
}

